In [1]:
import pandas as pd
import numpy as np

In [2]:
#to display in row and column reshaped into 5 by 4 table 
table = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['column1','column2','column3','column4'])
table.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [3]:
table.to_csv('test.csv')
#to create a csv file named with test.csv from the dataframe

In [4]:
table.isnull().sum()
#to check if there is null in our dataframe

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [5]:
table[['column1','column3']]
#to display column1 and column3

      column1  column3
row1        0        2
row2        4        6
row3        8       10
row4       12       14
row5       16       18

In [6]:
pd.read_csv('test.csv')

  Unnamed: 0  column1  column2  column3  column4
0       row1        0        1        2        3
1       row2        4        5        6        7
2       row3        8        9       10       11
3       row4       12       13       14       15
4       row5       16       17       18       19

In [7]:
from io import StringIO,BytesIO

In [8]:
data =('index,a,b,c\n'
        '4,apple,bat,5,7\n'
        'B,orange,cow,10')

In [9]:
pd.read_csv(StringIO(data),index_col=1)

       index    a   b    c
apple      4  bat   5  7.0
orange     B  cow  10  NaN

In [10]:
#data2 = '{"name":"kibrom","age":24,"class":"4th"}'
#json2 = pd.read_json(data2)
#print(json2)

# JSON data as a string
data2 = '{"name":"kibrom","age":24,"class":"4th"}'

# Convert JSON to a DataFrame
json2 = pd.read_json(StringIO(data2),typ='series')  # typ='series' will convert it to a Pandas Series

print(json2)

name     kibrom
age          24
class       4th
dtype: object

In [11]:
type(json2)

pandas.core.series.Series

In [12]:
csv2 = json2.to_csv('json.csv')

In [13]:
my_csv = pd.read_csv('json.csv')
my_csv.head()

  Unnamed: 0       0
0       name  kibrom
1        age      24
2      class     4th

In [14]:
df = pd.DataFrame({
"name":['kibrom','ela','yabsra'],
"age":[24,19,2],
"sex":['male','female','male']
}
)

In [15]:
#to decribe the numerical column
df.describe()

             age
count   3.000000
mean   15.000000
std    11.532563
min     2.000000
25%    10.500000
50%    19.000000
75%    21.500000
max    24.000000

In [16]:
df['age']

0    24
1    19
2     2
Name: age, dtype: int64

In [30]:
df.describe()

             age
count   3.000000
mean   15.000000
std    11.532563
min     2.000000
25%    10.500000
50%    19.000000
75%    21.500000
max    24.000000

In [17]:
df['age'].max()

np.int64(24)

In [27]:
df['age'].min()

np.int64(2)

In [28]:
#pandas by defualt displays the first and last 5 rows
#pd.head(n) to see the first n rows
#pd.tail(n) to see the last n rows

In [29]:
df.tail(1)

     name  age   sex
2  yabsra    2  male

In [20]:
df.head(2)

     name  age     sex
0  kibrom   24    male
1     ela   19  female

In [21]:
df.to_excel('family.xlsx', sheet_name='memebers',index=False)

In [22]:
kb=pd.read_excel('family.xlsx',sheet_name='memebers')
kb.head()

     name  age     sex
0  kibrom   24    male
1     ela   19  female
2  yabsra    2    male

In [23]:
kb.info() # to know about the data
#strings are objects in pandas
#numbers of entries is = the numbers of rows

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   sex     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [34]:
age=pd.Series([23,54,67],name="age")
age.max()

np.int64(67)

In [37]:
DF=pd.read_csv("vgsales.csv")
DF.head(10)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
5,6,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,0.58,30.26
6,7,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
7,8,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,2.85,29.02
8,9,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
9,10,Duck Hunt,NES,1984.0,Shooter,Nintendo,26.93,0.63,0.28,0.47,28.31

In [39]:
DF.to_excel("vgsales.xlsx", index=False)

In [42]:
xl=pd.read_excel("vgsales.xlsx")
xl.head(7)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
5,6,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,0.58,30.26
6,7,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01

In [48]:
#to work with one column or Series
xl_NA_sales =xl[['NA_Sales']]
xl_NA_sales.head(6).max()

NA_Sales    41.49
dtype: float64

In [50]:
xl[['NA_Sales']]>20

       NA_Sales
0          True
1          True
2         False
3         False
4         False
...         ...
16593     False
16594     False
16595     False
16596     False
16597     False

[16598 rows x 1 columns]

In [53]:
#to filter or check a column or raws we use isin() method
filtered_list=df[df["name"].isin(["kibrom","ela"])]
filtered_list.head()

     name  age     sex
0  kibrom   24    male
1     ela   19  female

In [54]:
df[df["name"].isin(["kibrom","ela"])]

     name  age     sex
0  kibrom   24    male
1     ela   19  female

In [55]:
#conditional operators use brackets for both separately () we use conditional operator
df[(df["name"]=='kb')|(df["name"]=='yabsra')]
#it display only "yabsra" because there is no name with 'kb'

     name  age   sex
2  yabsra    2  male

In [ ]:
#notna() means =notnull display "True" if there value ,displays "False" for no value
#isna() means = isnull >>>>>>>"False"------------------------------"True"

In [56]:
#displays the order of the dataframe (row by column)
df.shape

(3, 3)

In [60]:
#loc = for labeled
#iloc = to access based on index number
df.iloc[0]

name    kibrom
age         24
sex       male
Name: 0, dtype: object